In [ ]:
import pandas as pd

Install this support library:
- openpyxl: `pip install openpyxl`

In [ ]:
df=pd.read_excel("datasets/book1.xlsx", 
              header=None, 
              names=['#','col1','col2','col3','col4'],
              index_col=0)

In [ ]:
df # datsframe

In [ ]:
df['col1'] # series

In [ ]:
df['col1','col3']

In [ ]:
df.iloc[0] #row 0

In [ ]:
print(df['col1'].sum()) # sum of col1
print(df['col1'].mean()) # mean of col2
print(df['col1'].max()) # max of col3

In [ ]:
df.col1.plot(kind='bar')

In [ ]:
df.col1.plot(kind='kde')

In [ ]:
df.plot(kind='bar')

passing your manual data dictionary to pandas

In [ ]:
data = {
    "country": ["india","brazil","california","america","argentina"],
    "population": [200.89,143.5,887,889,565],
    "gdp": [1.86,1.3,2.6,11.4,0.29],
    "area": [98767,78966,8668,6788,9657]
}

cdf = pd.DataFrame(data)
cdf

In [ ]:
cdf.plot(kind='bar', x='country', y='population', figsize=(6,4))

In [ ]:
cdf.plot(kind='bar', x='country', y='population',logy=True)

In [ ]:
cdf.plot(kind='bar', x='country', y='population',logy=True,
         color='green',
         alpha='0.5',
         hatch='//',
         edgecolor='white')

In [ ]:
cdf.columns.tolist()

pandas Dataframe manipulation

- rename columns
- replace values
- add new columns
- remove columns
- drop duplicates
- drop rows with missing values
- creating subsets
- merging dataframes

In [ ]:
import numpy as np
df = pd.DataFrame({
    'Rank': [1,2,3,4,5],
    'country name': ["India", "United States","Indonesia","Pakistan","Brazil"],
    'currency': ['INR','USD',np.nan,np.nan,np.nan]
})
df

In [ ]:
df['country name']

In [ ]:
df = df.rename(
    columns={
        'Rank': 'rank',
        'country name': 'country'

    }
)

In [ ]:
df

In [ ]:
df.iloc[4] = df.iloc[4].replace(np.nan,"BRL")  #updating cell value

In [ ]:
df

In [ ]:
# adding a column
df['colx'] = 10

In [ ]:
values = [11,22,33,44,55]
df['coly'] = values
df

In [ ]:
# adding column based on operation on other columns
df['colz']=df['colx']*df['coly']
df

In [ ]:
# remove column 
df=df.drop(columns=['colx'])

In [50]:
df

   rank        country currency  coly  colz
0     1          India      INR    11   110
1     2  United States      USD    22   220
2     3      Indonesia      NaN    33   330
3     4       Pakistan      NaN    44   440
4     5         Brazil      BRL    55   550

In [51]:
df.drop_duplicates(subset=['coly'])

   rank        country currency  coly  colz
0     1          India      INR    11   110
1     2  United States      USD    22   220
2     3      Indonesia      NaN    33   330
3     4       Pakistan      NaN    44   440
4     5         Brazil      BRL    55   550

In [52]:
df.dropna()

   rank        country currency  coly  colz
0     1          India      INR    11   110
1     2  United States      USD    22   220
4     5         Brazil      BRL    55   550

In [54]:
adf = pd.DataFrame({
    'A': [1,2,3,4],
    'B': [5,6,7,8]
})
bdf = pd.DataFrame({
    'C': [2,3,5,1],
    'D': [6,7,8,9]
})
cdf = pd.DataFrame({
    'A': [5,6,7,8],
    'B': [9,10,11,12]
})

In [57]:
# merge two dataframes
pd.concat([adf,bdf], axis=1) # col wise

   A  B  C  D
0  1  5  2  6
1  2  6  3  7
2  3  7  5  8
3  4  8  1  9

In [58]:
pd.concat([adf,bdf]) # row wise

     A    B    C    D
0  1.0  5.0  NaN  NaN
1  2.0  6.0  NaN  NaN
2  3.0  7.0  NaN  NaN
3  4.0  8.0  NaN  NaN
0  NaN  NaN  2.0  6.0
1  NaN  NaN  3.0  7.0
2  NaN  NaN  5.0  8.0
3  NaN  NaN  1.0  9.0